<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">IF, ELSEIF , ELSE</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">In MySQL, the IF, ELSEIF, and ELSE constructs are typically used within stored procedures, functions, or triggers to implement conditional logic. <br><br>They are part of the procedural SQL constructs available in these contexts.</div>

In [1]:
from urllib.parse import quote
encoded_password = quote("Mubeen@12345", safe="")
connection_string = f"mysql+pymysql://sweeterror404:{encoded_password}@localhost:3306/mubeen"
%load_ext sql
%sql $connection_string

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Syntax IF <br><ul>IF condition THEN<br>code ;<br> END IF;</ul> 
</div>

In [8]:
%%sql

CREATE PROCEDURE IF_pro(IN value INT)

BEGIN
    DECLARE result_message VARCHAR(100);

    IF value > 0 THEN
        SET result_message = 'Value is Greater Than 0 ';
    END IF;

    SELECT result_message AS Result;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [3]:
%sql CALL IF_pro(10)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is Greater Than 0 ',)]

In [5]:
%sql CALL IF_pro(1)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is Greater Than 0 ',)]

In [6]:
%sql CALL IF_pro(-1)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(None,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Syntax IF ELSE <br><ul>IF condition THEN<br>code ;<br>ELSE code;<br> END IF;</ul> 
</div>

In [13]:
%%sql

CREATE PROCEDURE IF_ELSE_pro(IN value INT)

BEGIN

    DECLARE result_message VARCHAR(100);

    IF value = 0 THEN
        SET result_message = 'Value is 0 ';
    ELSE 
        SET result_message = 'Value is Not 0';
    END IF;

    SELECT result_message AS Result;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [14]:
%sql CALL IF_ELSE_pro(0)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is 0 ',)]

In [17]:
%sql CALL IF_ELSE_pro(1)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is Not 0',)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Syntax IF ELSEIF and ELSE <br><ul>IF condition THEN<br>code ;<br>ELSEIF condition THEN<br>code ;<br>ELSE code ;<br> END IF ;</ul> 
</div>

In [24]:
%%sql

CREATE PROCEDURE my_cond(IN value INT)

BEGIN

    DECLARE result_message VARCHAR(100);

    IF value > 0 THEN
        SET result_message = 'Value is positive';
    ELSEIF value < 0 THEN
        SET result_message = 'Value is negative';
    ELSE 
        SET result_message = 'Value is 0';
    END IF;

    SELECT result_message AS Result;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [25]:
%sql CALL my_cond(1)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is positive',)]

In [26]:
%sql CALL my_cond(-1)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is negative',)]

In [27]:
%sql CALL my_cond(0)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is 0',)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Drop procedures</ul> 
</div>

In [30]:
%%sql
DROP PROCEDURE my_cond

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [31]:
%%sql
DROP PROCEDURE IF_ELSE_pro

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [32]:
%%sql
DROP PROCEDURE IF_pro

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Use in Functions</div>

In [39]:
%%sql

CREATE FUNCTION my_cond(value INT) RETURNS VARCHAR(255)
DETERMINISTIC
BEGIN
    DECLARE result_message VARCHAR(100);
    IF value > 0 THEN
        SET result_message = 'Value is positive';
    ELSEIF value < 0 THEN
        SET result_message = 'Value is negative';
    ELSE 
        SET result_message = 'Value is 0';
    END IF;

    RETURN result_message;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [40]:
%sql SELECT my_cond(1)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is positive',)]

In [41]:
%sql SELECT my_cond(-1)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is negative',)]

In [42]:
%sql SELECT my_cond(0)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Value is 0',)]

In [43]:
%%sql
DROP FUNCTION my_cond

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Create Procedure use two Clause columns, limits
</div>

In [92]:
%%sql
CREATE PROCEDURE extract_data(IN columns VARCHAR(255),IN limits VARCHAR(255))

BEGIN
    IF columns IS NULL AND limits IS NULL THEN
        SET @query = 'SELECT * FROM laptop_bk';
    
    ELSEIF columns IS NOT NULL AND limits IS NULL THEN
        SET @query = CONCAT('SELECT ',columns,' FROM laptop_bk');
    
    ELSEIF columns IS NULL AND limits IS NOT NULL THEN
        SET @query = CONCAT('SELECT * FROM laptop_bk LIMIT ',limits);

    ELSEIF columns IS NOT NULL AND limits IS NOT NULL THEN
        SET @query = CONCAT('SELECT ',columns,' FROM laptop_bk LIMIT ',limits);
    
    END IF;

    PREPARE st FROM @query;
    EXECUTE st;
    DEALLOCATE PREPARE st;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [101]:
%%sql
CALL extract_data("id,Company,Price",'3')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1, 'Apple', Decimal('71379.0')),
 (2, 'Apple', Decimal('47896.0')),
 (3, 'HP', Decimal('30636.0'))]

In [103]:
%%sql
CALL extract_data(NULL,'3')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0')),
 (2, 'Apple', 'Ultrabook', Decimal('13.3'), 1440, 900, 0, 0, 'Intel', 'Core i5', Decimal('1.8'), 8, 'Flash Storage', 128, 0, 'Intel', ' HD Graphics 6000', 'Mac', Decimal('1.3'), Decimal('47896.0')),
 (3, 'HP', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Core 7200U', Decimal('2.5'), 8, 'SSD', 256, 0, 'Intel', ' HD Graphics 620', 'N/A', Decimal('1.9'), Decimal('30636.0'))]

In [104]:
%%sql
DROP PROCEDURE extract_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Create Procedure use three Caluse columns, limits, where
</div>

In [110]:
%%sql
CREATE PROCEDURE extract_data(
    IN columns VARCHAR(255),
    IN conditions VARCHAR(255),
    IN limits VARCHAR(255)
)

BEGIN

    IF columns IS NULL AND limits IS NULL AND conditions IS NULL THEN
        SET @query = 'SELECT * FROM laptop_bk';
    
    ELSEIF columns IS NOT NULL AND limits IS NULL AND conditions IS NULL THEN -- col
        SET @query = CONCAT('SELECT ',columns,' FROM laptop_bk');
    
    ELSEIF columns IS NOT NULL AND limits IS NOT NULL AND conditions IS NULL THEN -- col,limit
        SET @query = CONCAT('SELECT ',columns, ' FROM laptop_bk LIMIT ',limits);

    ELSEIF columns IS NOT NULL AND conditions IS NOT NULL AND limits IS NULL THEN  -- col,condition
        SET @query = CONCAT('SELECT ',columns,' FROM laptop_bk WHERE ',conditions);

    ELSEIF columns IS NULL AND conditions IS NOT NULL AND limits IS NULL THEN  -- condition
        SET @query = CONCAT('SELECT * FROM laptop_bk WHERE ',conditions);

    ELSEIF columns IS NULL AND conditions IS NOT NULL AND limits IS NOT NULL THEN  -- condition,limit
        SET @query = CONCAT('SELECT * FROM laptop_bk WHERE ',conditions,' LIMIT ',limits);

    ELSEIF columns IS NULL AND conditions IS NULL AND limits IS NOT NULL THEN  -- limit
        SET @query = CONCAT('SELECT * FROM laptop_bk LIMIT ',limits);
    

    END IF;

    PREPARE st FROM @query;
    EXECUTE st;
    DEALLOCATE PREPARE st;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [107]:
%%sql
CALL extract_data("id,Company,Price",NULL,3)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1, 'Apple', Decimal('71379.0')),
 (2, 'Apple', Decimal('47896.0')),
 (3, 'HP', Decimal('30636.0'))]

In [111]:
%%sql
CALL extract_data(NULL,NULL,3)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0')),
 (2, 'Apple', 'Ultrabook', Decimal('13.3'), 1440, 900, 0, 0, 'Intel', 'Core i5', Decimal('1.8'), 8, 'Flash Storage', 128, 0, 'Intel', ' HD Graphics 6000', 'Mac', Decimal('1.3'), Decimal('47896.0')),
 (3, 'HP', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Core 7200U', Decimal('2.5'), 8, 'SSD', 256, 0, 'Intel', ' HD Graphics 620', 'N/A', Decimal('1.9'), Decimal('30636.0'))]

In [116]:
%%sql
CALL extract_data("id,Company,Price",'Company="Chuwi"',NULL)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(30, 'Chuwi', Decimal('13053.0')),
 (410, 'Chuwi', Decimal('23923.0')),
 (471, 'Chuwi', Decimal('13261.0'))]

In [117]:
%%sql
CALL extract_data(NULL,'Company="Chuwi"',NULL)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(30, 'Chuwi', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Atom x5-Z8300', Decimal('1.4'), 4, 'Flash Storage', 64, 0, 'Intel', ' HD Graphics', 'Windows', Decimal('1.9'), Decimal('13053.0')),
 (410, 'Chuwi', 'Notebook', Decimal('12.3'), 2736, 1824, 0, 1, 'Intel', 'Celeron N3450', Decimal('1.1'), 6, 'Flash Storage', 64, 0, 'Intel', ' HD Graphics 500', 'Windows', Decimal('1.4'), Decimal('23923.0')),
 (471, 'Chuwi', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Atom x5-Z8350', Decimal('1.4'), 4, 'Flash Storage', 64, 0, 'Intel', ' HD Graphics', 'Windows', Decimal('1.9'), Decimal('13261.0'))]

In [122]:
%%sql
CALL extract_data("id,Company,Price,Weight",'Weight > 5',NULL)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
8 rows affected.

[(129, 'Acer', Decimal('30476.0'), Decimal('7.2')),
 (168, 'Toshiba', Decimal('26054.0'), Decimal('5.4')),
 (232, 'Lenovo', Decimal('31382.0'), Decimal('7.2')),
 (293, 'Lenovo', Decimal('34579.0'), Decimal('5.8')),
 (317, 'Acer', Decimal('29251.0'), Decimal('8.2')),
 (574, 'Lenovo', Decimal('89137.0'), Decimal('8.4')),
 (614, 'Asus', Decimal('101232.0'), Decimal('11.1')),
 (640, 'Dell', Decimal('48964.0'), Decimal('6.2'))]

In [123]:
%%sql
DROP PROCEDURE extract_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note ! it is better to use Case Statments
</div>

In [196]:
%%sql
CREATE PROCEDURE extract_data(
    IN columns VARCHAR(255),
    IN conditions VARCHAR(255),
    IN limits VARCHAR(255)
)

BEGIN
   SET 
    @query = (CASE 
        WHEN columns IS NULL AND conditions IS NULL AND limits IS NULL 
            THEN "SELECT * FROM laptop_bk"
        
        WHEN columns IS NOT NULL AND conditions IS NULL AND limits IS NULL 
            THEN CONCAT('SELECT ',columns,' FROM laptop_bk')  

        WHEN columns IS NOT NULL AND conditions IS NOT NULL AND limits IS NULL 
            THEN CONCAT('SELECT ',columns,' FROM laptop_bk WHERE ',conditions)  

        WHEN columns IS NOT NULL AND conditions IS NULL AND limits IS NOT NULL 
            THEN CONCAT('SELECT ',columns,' FROM laptop_bk LIMIT ',limits)  

        WHEN columns IS NULL AND conditions IS NOT NULL AND limits IS NOT NULL 
            THEN CONCAT('SELECT * FROM laptop_bk WHERE ',conditions,' LIMIT ',limits)  

        WHEN columns IS NULL AND conditions IS NOT NULL AND limits IS NULL 
            THEN CONCAT('SELECT * FROM laptop_bk WHERE ',conditions)  

        WHEN columns IS NULL AND conditions IS NULL AND limits IS NOT NULL 
            THEN CONCAT('SELECT * FROM laptop_bk LIMIT ',limits)  

        
    END);

    PREPARE st FROM @query;
    EXECUTE st;
    DEALLOCATE PREPARE st;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [183]:
%sql CALL extract_data("id,Company,Price","Company = \"Chuwi\"",NULL)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(30, 'Chuwi', Decimal('13053.0')),
 (410, 'Chuwi', Decimal('23923.0')),
 (471, 'Chuwi', Decimal('13261.0'))]

In [185]:
%sql CALL extract_data("id,Company,Price",NULL,3)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1, 'Apple', Decimal('71379.0')),
 (2, 'Apple', Decimal('47896.0')),
 (3, 'HP', Decimal('30636.0'))]

In [186]:
%sql CALL extract_data(NULL,"Company = \"HP\"",3)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(3, 'HP', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Core 7200U', Decimal('2.5'), 8, 'SSD', 256, 0, 'Intel', ' HD Graphics 620', 'N/A', Decimal('1.9'), Decimal('30636.0')),
 (11, 'HP', 'Notebook', Decimal('15.6'), 1366, 768, 0, 0, 'Intel', 'Core 7200U', Decimal('2.5'), 4, 'HDD', 500, 0, 'Intel', ' HD Graphics 620', 'N/A', Decimal('1.9'), Decimal('20987.0')),
 (12, 'HP', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Core 6006U', Decimal('2.0'), 4, 'HDD', 500, 0, 'Intel', ' HD Graphics 520', 'N/A', Decimal('1.9'), Decimal('18381.0'))]

In [198]:
%sql CALL extract_data(NULL,"Company = \"Chuwi\"",NULL)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(30, 'Chuwi', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Atom x5-Z8300', Decimal('1.4'), 4, 'Flash Storage', 64, 0, 'Intel', ' HD Graphics', 'Windows', Decimal('1.9'), Decimal('13053.0')),
 (410, 'Chuwi', 'Notebook', Decimal('12.3'), 2736, 1824, 0, 1, 'Intel', 'Celeron N3450', Decimal('1.1'), 6, 'Flash Storage', 64, 0, 'Intel', ' HD Graphics 500', 'Windows', Decimal('1.4'), Decimal('23923.0')),
 (471, 'Chuwi', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Atom x5-Z8350', Decimal('1.4'), 4, 'Flash Storage', 64, 0, 'Intel', ' HD Graphics', 'Windows', Decimal('1.9'), Decimal('13261.0'))]

In [201]:
%sql CALL extract_data(NULL,NULL,'49,4')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[(50, 'HP', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'AMD', 'A6-Series 9220', Decimal('2.5'), 4, 'SSD', 256, 0, 'AMD', ' Radeon R4 Graphics', 'Windows', Decimal('1.9'), Decimal('21232.0')),
 (51, 'HP', 'Notebook', Decimal('13.3'), 1920, 1080, 0, 0, 'Intel', 'Core 8550U', Decimal('1.8'), 8, 'SSD', 512, 0, 'Intel', ' UHD Graphics 620', 'Windows', Decimal('1.5'), Decimal('58768.0')),
 (52, 'Acer', 'Notebook', Decimal('15.6'), 1366, 768, 0, 0, 'Intel', 'Core 7100U', Decimal('2.4'), 4, 'HDD', 1024, 0, 'Intel', ' HD Graphics 620', 'Windows', Decimal('2.4'), Decimal('20460.0')),
 (53, 'Dell', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Core 8550U', Decimal('1.8'), 8, 'SSD', 256, 0, 'AMD', ' Radeon 520', 'Windows', Decimal('2.1'), Decimal('40908.0'))]

In [11]:
%%sql
DROP PROCEDURE extract_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now apply same logic in smart way
</div>

In [12]:
%%sql

SET @columns = "Price,";
SET @conditions = "Price > 200";
SET @limits = "2";

SET @query = CONCAT(
        'SELECT ', 
        COALESCE(@columns, '*'), 
        ' FROM laptop_bk', 
        IF(@conditions IS NOT NULL, CONCAT(' WHERE ',@conditions), ''), 
        IF(@limits IS NOT NULL, CONCAT(' LIMIT ', @limits), '')
    );

SELECT @query;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.

[('SELECT Price, FROM laptop_bk WHERE Price > 200 LIMIT 2',)]

In [13]:
%%sql

CREATE PROCEDURE extract_data(
    IN columns VARCHAR(255), 
    IN conditions VARCHAR(255), 
    IN limits VARCHAR(255)
)

BEGIN
    SET @query = CONCAT(
        'SELECT ', 
        COALESCE(columns, '*'), 
        ' FROM laptop_bk', 
        IF(conditions IS NOT NULL, CONCAT(' WHERE ',conditions), ''), 
        IF(limits IS NOT NULL, CONCAT(' LIMIT ', limits), '')
    );


    PREPARE st FROM @query;
    EXECUTE st;
    DEALLOCATE PREPARE st;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [14]:
%sql CALL extract_data(NULL,NULL,"2")

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0')),
 (2, 'Apple', 'Ultrabook', Decimal('13.3'), 1440, 900, 0, 0, 'Intel', 'Core i5', Decimal('1.8'), 8, 'Flash Storage', 128, 0, 'Intel', ' HD Graphics 6000', 'Mac', Decimal('1.3'), Decimal('47896.0'))]

In [15]:
%sql CALL extract_data("id,Price",NULL,1)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, Decimal('71379.0'))]

In [16]:
%sql CALL extract_data("id,Price,TypeName","TypeName = \"Ultrabook\"","50,4")

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[(278, Decimal('52055.0'), 'Ultrabook'),
 (290, Decimal('78215.0'), 'Ultrabook'),
 (302, Decimal('133147.0'), 'Ultrabook'),
 (318, Decimal('55939.0'), 'Ultrabook')]

In [17]:
%sql CALL extract_data(NULL,"Company = \"Chuwi\"",NULL)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(30, 'Chuwi', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Atom x5-Z8300', Decimal('1.4'), 4, 'Flash Storage', 64, 0, 'Intel', ' HD Graphics', 'Windows', Decimal('1.9'), Decimal('13053.0')),
 (410, 'Chuwi', 'Notebook', Decimal('12.3'), 2736, 1824, 0, 1, 'Intel', 'Celeron N3450', Decimal('1.1'), 6, 'Flash Storage', 64, 0, 'Intel', ' HD Graphics 500', 'Windows', Decimal('1.4'), Decimal('23923.0')),
 (471, 'Chuwi', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Atom x5-Z8350', Decimal('1.4'), 4, 'Flash Storage', 64, 0, 'Intel', ' HD Graphics', 'Windows', Decimal('1.9'), Decimal('13261.0'))]